#+TITLE: Code Block Showcase
#+DATE: 2026-01-29

** Python with text output

#+BEGIN_SRC python :exports both
import sys
print(f"Python {sys.version}")
print("Hello from Python!")
#+END_SRC

#+RESULTS:
: Python 3.12.0 (main, Oct  2 2024)
: Hello from Python!

** Shell with output

#+BEGIN_SRC shell :exports both
echo "Current date: $(date)"
echo "User: $(whoami)"
#+END_SRC

#+RESULTS:
: Current date: Wed Jan 29 11:45:00 EST 2026
: User: hh

** Step 1: Generate data (Python)

#+BEGIN_SRC python :exports both :results output
# Simulate fetching data
data = [
    {"id": 1, "name": "Alice", "role": "admin"},
    {"id": 2, "name": "Bob", "role": "editor"},
    {"id": 3, "name": "Carol", "role": "author"}
]
import json
print(json.dumps(data))
#+END_SRC

#+RESULTS:
: [{"id": 1, "name": "Alice", "role": "admin"}, {"id": 2, "name": "Bob", "role": "editor"}, {"id": 3, "name": "Carol", "role": "author"}]

** Step 2: Transform with jq (Shell)

#+BEGIN_SRC shell :exports both :results output
echo '[{"id": 1, "name": "Alice", "role": "admin"}, {"id": 2, "name": "Bob", "role": "editor"}]' | \
  jq '.[] | "User: \(.name) (\(.role))"'
#+END_SRC

#+RESULTS:
: "User: Alice (admin)"
: "User: Bob (editor)"

